export default function IeltsWhenToTakeSection() {
    return (
        <section className="mx-auto mt-10 bg-white p-4 md:p-8 rounded-xl">
            <h2 className="text-2xl md:text-3xl font-bold mb-3">
                ৬. কখন আমার আইইএলটিএস পরীক্ষায় অংশ নেওয়া উচিত?
            </h2>
            <p className="mb-4 text-gray-800 text-base leading-relaxed">
                আপনার পছন্দের ইনটেকের উপর নির্ভর করে, সাধারণত কাঙ্ক্ষিত ইনটেকের ৩-৬ মাস আগে আইইএলটিএস পরীক্ষায় অংশ
                নেওয়ার পরামর্শ দেওয়া হয়। সুতরাং, যদি আপনি সেপ্টেম্বর ২০২৫ ইনটেকের জন্য আবেদন করতে চান, তাহলে আপনার
                মার্চ থেকে মে মাসের মধ্যে আইইএলটিএস পরীক্ষায় অংশ নেওয়া উচিত। এটি আপনাকে নিম্নলিখিত সুবিধা দেবে:
            </p>
            <ul className="list-disc pl-6 space-y-2 text-gray-800 text-base mb-5">
                <li>
                    আপনার কলেজ আবেদনের জন্য আগে থেকেই প্রস্তুত থাকতে পারবেন এবং অন্যান্য নথিপত্রের দিকে মনোযোগ দিতে
                    পারবেন।
                </li>
                <li>
                    প্রয়োজন হলে আপনার ব্যান্ড স্কোর উন্নত করার জন্য পরীক্ষাটি আবার দিতে পারবেন।
                </li>
            </ul>
            <p className="mb-4 text-gray-800 text-base leading-relaxed">
                আইইএলটিএস পরীক্ষার স্কোর পরীক্ষার তারিখ থেকে ২ বছরের জন্য বৈধ থাকে। তাই, আপনার উদ্দেশ্যমূলক ইনটেকের ৩-৬
                মাস আগে আইইএলটিএস পরীক্ষায় অংশ নেওয়া উপযুক্ত সময়।
            </p>
            <p className="mb-4 text-gray-800 text-base leading-relaxed">
                এছাড়াও, এটি মনে রাখা গুরুত্বপূর্ণ যে জানুয়ারি থেকে মার্চ এবং জুন থেকে আগস্ট মাসগুলো ভারতে আইইএলটিএস
                পরীক্ষার জন্য উচ্চ চাহিদার মাস। তাই, পরবর্তীতে অসুবিধা এড়াতে আপনার সুবিধামতো পরীক্ষা কেন্দ্রে আইইএলটিএস
                পরীক্ষা আগে থেকেই বুক করা উচিত। আপনি এক বছর আগেও আইইএলটিএস পরীক্ষা বুক করতে পারবেন এবং তারিখ পরিবর্তনের
                (reschedule) বিকল্পও থাকবে। আইইএলটিএস রেজিস্ট্রেশন সম্পর্কে এখানে একটি বিস্তারিত নির্দেশিকা রয়েছে।
            </p>
        </section>
    );
}
