import { CustomDataTable } from "@/components/CustomDataTable"

const examFormatColumns = [
    { key: "feature", header: "বৈশিষ্ট্য", width: "22%" },
    { key: "academic", header: "আইইএলটিএস একাডেমিক", width: "18%" },
    { key: "general", header: "IELTS General Training", width: "20%" },
    { key: "ukvi", header: "IELTS UKVI", width: "20%" }
];

const examFormatData = [
    {
        feature: "উদ্দেশ্য",
        academic: "উচ্চশিক্ষা, পেশাদার কোর্স",
        general: "অভিবাসন, কাজ, অ-একাডেমিক প্রশিক্ষণ",
        ukvi: "ইউকে-নির্দিষ্ট ভিসা (পড়াশোনা, কাজ, মাইগ্রেশন)"
    },
    {
        feature: "পরীক্ষার বিষয়বস্তু",
        academic: "একাডেমিক ইংরেজির উপর ফোকাস করে",
        general: "দৈনন্দিন ইংরেজির উপর ফোকাস করে",
        ukvi: "বিষয়বস্তু একাডেমিক/জেনারেল এর উপর নির্ভরশীল"
    },
    {
        feature: "গ্রহণযোগ্যতা",
        academic: "বিশ্বব্যাপী বিশ্ববিদ্যালয়গুলো",
        general: "বিশ্বব্যাপী অভিবাসন/কাজের জন্য",
        ukvi: "শুধুমাত্র ইউকে ভিসা প্রক্রিয়ার জন্য"
    },
    {
        feature: "পরীক্ষা কেন্দ্র",
        academic: "বিশ্বব্যাপী উপলব্ধ",
        general: "বিশ্বব্যাপী উপলব্ধ",
        ukvi: "শুধুমাত্র ইউকেভিআই-অনুমোদিত কেন্দ্রগুলিতে"
    },
    {
        feature: "কাদের প্রয়োজন?",
        academic: "আন্ডারগ্র্যাজুয়েট/পোস্টগ্র্যাজুয়েট বা পেশাদার সার্টিফিকেশনের জন্য শিক্ষার্থী",
        general: "অভিবাসী বা কর্মচারী যাদের ইংরেজি দক্ষতার প্রয়োজন",
        ukvi: "ইউকে পড়াশোনা, কাজ বা বসতি স্থাপন ভিসার আবেদনকারী"
    },
];

export default function IeltsExamFormatSection() {
    return (
        <section className="mx-auto mt-10 bg-white p-4 md:p-8 rounded-xl">
            <h2 className="text-2xl md:text-3xl font-bold mb-3">
                ৩. আইইএলটিএস পরীক্ষার ফরম্যাট: একাডেমিক বনাম জেনারেল ট্রেনিং
            </h2>
            <p className="mb-4 text-gray-800 text-base leading-relaxed">
                আইইএলটিএস পরীক্ষার বিভিন্ন ধরন রয়েছে। কারণ আইইএলটিএস শুধুমাত্র বিদেশে পড়াশোনার মধ্যেই সীমাবদ্ধ নয়। এটি কখনো কখনো কর্মজীবী ​​পেশাদার এবং অভিবাসন সংক্রান্ত প্রয়োজনেও ব্যবহৃত হয়। নিচের সারণীটি এটি বেশ ভালোভাবে তুলে ধরেছে। প্রতিটি আইইএলটিএস ধরন সম্পর্কে বিস্তারিত তথ্যও আপনি রেফারেন্সের জন্য পাবেন।
            </p>

            <CustomDataTable
                columns={examFormatColumns}
                data={examFormatData}
                className="my-8"
            />

            <p className="mt-4 text-gray-800 text-base leading-relaxed">
                বিদেশে পড়াশোনার আগ্রহীদের জন্য কোন ফরম্যাটটি সবচেয়ে প্রাসঙ্গিক, তা এই ভিন্ন ফরম্যাটগুলো দেখে বিভ্রান্তিকর মনে হতে পারে। একটি সাধারণ নিয়ম হিসেবে, বিদেশে পড়াশোনার সকল আকাঙ্ক্ষীকে তাদের ডিগ্রীর (UG/PG/PhD) ধরন নির্বিশেষে অবশ্যই আইইএলটিএস একাডেমিক পরীক্ষায় অংশ নিতে হবে। এরপর থেকে, অন্যথায় উল্লেখ না করা হলে, নিচের সমস্ত তথ্য আইইএলটিএস একাডেমিক পরীক্ষার জন্য প্রযোজ্য হবে।
            </p>
        </section>
    );
}
