export default function IeltsCostSection() {
    return (
        <section className="mx-auto mt-10 bg-white p-4 md:p-8 rounded-xl">
            <h2 className="text-2xl md:text-3xl font-bold mb-3">
                ৫. আইইএলটিএস (IELTS) পরীক্ষার খরচ কত?
            </h2>
            <p className="mb-4 text-gray-800 text-base leading-relaxed">
                বাংলাদেশের পরীক্ষাগুলোর তুলনায়, IELTS পরীক্ষার খরচ কিছুটা বেশি। সাধারণত IELTS পরীক্ষার খরচ প্রায় ১৮,০০০
                টাকা। শিক্ষার্থীরা নিজেদের স্কোর উন্নত করতে একাধিকবার এই পরীক্ষায় অংশ নিতে পারেন। তবে প্রতিবার পরীক্ষায়
                অংশগ্রহণের জন্য পুরো ফি পরিশোধ করতে হয়। IELTS পরীক্ষায় একটি নির্দিষ্ট অংশ পুনরায় দেওয়ার সুযোগও রয়েছে।
                উদাহরণস্বরূপ, যদি কোনো শিক্ষার্থী সব অংশে ভালো করে কিন্তু Speaking অংশে কাঙ্ক্ষিত স্কোর না পায়, তাহলে
                শুধুমাত্র Speaking অংশটি আবার দিতে পারে। এই সুবিধাকে বলা হয় IELTS One Skill Retake। একক স্কিল পুনরায়
                পরীক্ষার জন্য খরচ প্রায় ১২,০০০ টাকা।
            </p>
            <p className="text-gray-800 text-base leading-relaxed">
                তাই, যদিও একাধিকবার পরীক্ষায় বসা যায়, প্রথমবারেই কাঙ্ক্ষিত ব্যান্ড স্কোর অর্জন করা অর্থনৈতিকভাবে
                সাশ্রয়ী। বিভিন্ন ধরণের IELTS পরীক্ষার ফি সম্পর্কে আরও জানতে আপনি নির্ধারিত সূত্র থেকে তথ্য সংগ্রহ করতে
                পারেন।
            </p>
        </section>
    );
}
