export default function IeltsBandScoreMoreInfoSection() {
    return (
        <section className="mx-auto mt-10 bg-white p-4 md:p-8 rounded-xl">
            <h2 className="text-2xl md:text-3xl font-bold mb-3">
                ৯. আইইএলটিএস ব্যান্ড স্কোর সম্পর্কে আরও তথ্য
            </h2>
            <p className="mb-4 text-gray-800 text-base leading-relaxed">
                আগে যেমন উল্লেখ করা হয়েছে, আপনার নির্দিষ্ট বিশ্ববিদ্যালয় এবং কোর্সের জন্য ব্যান্ড স্কোরের
                প্রয়োজনীয়তা বোঝা গুরুত্বপূর্ণ। যদি আপনি ভর্তির প্রয়োজনীয়তা সম্পর্কে আরও জানতে চান, তাহলে আমাদের
                বিশেষজ্ঞ স্টাডি অ্যাব্রড কাউন্সেলরদের মধ্যে একজনের সাথে কথা বলুন।
            </p>
            <p className="mb-4 text-gray-800 text-base leading-relaxed">
                এমনকি সেরা পারফর্ম করা শিক্ষার্থীরাও সাধারণত ৮-ব্যান্ড স্কোরের বেশি পায় না, যেখানে বিদেশে পড়াশোনা করা
                অধিকাংশ শিক্ষার্থী ৬.৫ থেকে ৭.৫ এর মধ্যে স্কোর করে। আইইএলটিএস ব্যান্ড স্কোর এবং সেগুলো কিভাবে গণনা করা
                হয় সে সম্পর্কে এখানে আরও তথ্য দেওয়া হলো।
            </p>
        </section>
    );
}
