export default function WhatIsIeltsSection() {
    return (
        <section className="mx-auto mt-10 bg-white p-4 md:p-8 rounded-xl">
            <h2 className="text-2xl md:text-3xl font-bold mb-3">
                ১. আইইএলটিএস কী এবং বিদেশে পড়াশোনার জন্য এটি কেন গুরুত্বরপূর্ণ?
            </h2>
            <p className="mb-4 text-gray-800 text-base leading-relaxed">
                আইইএলটিএস (IELTS) এর পূর্ণরূপ হলো International English Language Testing System। এটি একটি প্রমিত পরীক্ষা
                যা শিক্ষার্থীদের ইংরেজি ভাষার দক্ষতা এবং পারদর্শিতা প্রমাণ করতে সাহায্য করে। বিশেষ করে যাদের মাতৃভাষা
                ইংরেজি নয়, তাদের জন্য এটি খুবই জরুরি। এছাড়া, যেসব শিক্ষার্থী তাদের দ্বাদশ শ্রেণীর বোর্ড পরীক্ষায়
                ইংরেজিতে পড়েননি, তাদের জন্যও আইইএলটিএস প্রয়োজন হয়।
            </p>
            <p className="mb-4 text-gray-800 text-base leading-relaxed">
                ইংরেজি যেখানে দৈনন্দিন জীবনের সরকারি বা পছন্দের ভাষা, সেসব দেশের জন্য আইইএলটিএস অপরিহার্য। আইইএলটিএস
                ছাড়াও, পিটিই (PTE), টোয়েফল (TOEFL) এবং ডিইটি (DET) এর মতো অন্যান্য পরীক্ষাও একই উদ্দেশ্যে ব্যবহৃত হয়।
            </p>
            <p className="mb-4 text-gray-800 text-base leading-relaxed">
                আইইএলটিএস পরীক্ষা সম্পর্কে বিস্তারিত জানার আগে, আপনার এই পরীক্ষা দেওয়া উচিত কিনা তা জানা জরুরি।
                সংক্ষেপে বলতে গেলে, আপনি যদি যুক্তরাজ্য, যুক্তরাষ্ট্র, অস্ট্রেলিয়া, নিউজিল্যান্ড বা আয়ারল্যান্ডে
                উচ্চশিক্ষার পরিকল্পনা করেন, তাহলে সম্ভবত আপনার আইইএলটিএস এর প্রয়োজন হবে। এর কিছু ব্যতিক্রমও আছে, যা
                সাধারণত IELTS waivers নামে পরিচিত। আপনার পছন্দের প্রতিষ্ঠান আইইএলটিএস গ্রহণ করে কিনা, তা আপনি এখানে
                যাচাই করে নিতে পারেন।
            </p>
        </section>
    );
}
