export default function LorIntroSection() {
    return (
        <section className="mx-auto max-w-6xl bg-white p-6 md:p-8 rounded-xl my-8">
            <h2 className="text-2xl md:text-3xl font-bold mb-3 text-[#232345]">
                চিন্তা করবেন না, শুধু পড়তে থাকুন।
            </h2>
            <p className="text-gray-900 text-base leading-relaxed mb-4">
                মাস্টার্সের জন্য কার্যকর একটি LOR (Letter of Recommendation) লিখতে হলে এর উদ্দেশ্যটি আগে বুঝতে হবে।
                এই চিঠিতে আপনার শক্তি, অর্জন এবং নির্বাচিত কোর্সে সফল হওয়ার সম্ভাবনাকে তুলে ধরা উচিত। এটি এমন কারও দ্বারা লেখা উচিত যিনি আপনাকে ভালোভাবে চেনেন—যেমন একজন অধ্যাপক, মেন্টর বা পূর্ববর্তী নিয়োগকর্তা। কারও কাছে যদি আপনি LOR লেখার অনুরোধ করেন, তবে নিশ্চিত করুন তিনি আপনার কাজ সম্পর্কে ইতিবাচক ধারণা রাখেন এবং তাদের বক্তব্য সমর্থন করার মতো নির্দিষ্ট উদাহরণ দিতে পারেন। উপরোক্ত LOR-এর নমুনাটি একটি মৌলিক রেফারেন্স হিসেবে ব্যবহার করুন, যা আপনার নিজের সুপারিশপত্র তৈরি করতে সহায়তা করবে।
            </p>
            <p className="text-gray-900 text-base leading-relaxed mb-4">
                কাউকে যখন আপনি LOR লেখার জন্য অনুরোধ করবেন, তখন প্রয়োজনীয় সব তথ্য তাকে দিতে হবে। এর মধ্যে থাকবে আপনি যে কোর্সের জন্য আবেদন করছেন তার বিস্তারিত এবং জমা দেওয়ার নির্দিষ্ট সময়সীমা। এতে লেখক আরও নির্দিষ্ট ও কার্যকর LOR লিখতে পারবেন, যা আপনার আবেদনের মান অনেক বাড়িয়ে দেবে। এই ব্লগে আমরা আরও জানব মাস্টার্সের জন্য সুপারিশপত্র (LOR) এবং কার কাছে এটি চাইবেন সে বিষয়ে।
            </p>
        </section>
    );
}
