export default function LorWhomToAskSection() {
    return (
        <section className="mx-auto max-w-6xl bg-white p-6 md:p-8 rounded-xl my-8">
            <h2 className="text-2xl md:text-3xl font-bold mb-4 text-[#6A55EA]">
                কার কাছ থেকে সুপারিশপত্র চাইবেন?
            </h2>
            <p className="text-gray-900 text-base leading-relaxed mb-4">
                যদি আপনি আন্তর্জাতিক কোনো বিশ্ববিদ্যালয়ে মাস্টার্স প্রোগ্রাম করতে চান, তবে বুঝতে হবে যে বিশ্ববিদ্যালয়গুলো শুধু আপনার গ্রেড দেখেই সিদ্ধান্ত নেয় না। তারা আপনার পূর্ববর্তী অভিজ্ঞতা, ব্যক্তিত্ব, দক্ষতা এবং গুণাবলীতেও আগ্রহী। এ ক্ষেত্রেই লেটার অব রেকমেন্ডেশন (LOR) গুরুত্বপূর্ণ ভূমিকা পালন করে।
            </p>
            <p className="text-gray-900 text-base leading-relaxed mb-2">
                আপনি কাকে রিকমেন্ডেশন লেটার লেখার জন্য বেছে নেবেন, তা নির্ভর করে—
            </p>
            <ul className="list-disc pl-6 space-y-2 text-gray-900 mb-5">
                <li>বিশ্ববিদ্যালয়ের ধরন</li>
                <li>যে প্রোগ্রামের জন্য আবেদন করছেন</li>
            </ul>
            <p className="text-gray-900 text-base leading-relaxed mb-4">
                কিছু বিশ্ববিদ্যালয়ে রেকমেন্ডারের জন্য নির্দিষ্ট শর্ত থাকে, যেমন: অধ্যাপক, পেশাগত মেন্টর অথবা পূর্ববর্তী নিয়োগকর্তা। যদি কোনো অধ্যাপকের রিকমেন্ডেশন চাওয়া হয়, তবে চিঠিতে আপনার একাডেমিক দক্ষতা ও সাফল্যগুলোর ওপর জোর দেওয়া উচিত। আবার, যদি পূর্ববর্তী নিয়োগকর্তার রিকমেন্ডেশন প্রয়োজন হয়, তবে সেখানে মাস্টার্স প্রোগ্রামের সাথে সম্পর্কিত আপনার নির্দিষ্ট দক্ষতাগুলো তুলে ধরা উচিত।
            </p>
            <p className="text-gray-900 text-base leading-relaxed mb-4">
                আপনার রিজিউমে, বিশেষ অর্জন এবং ভবিষ্যৎ লক্ষ্যগুলো রেকমেন্ডারকে জানালে তারা আরও ব্যক্তিগতকৃত ও কার্যকর LOR লিখতে পারবেন।
            </p>
            <p className="text-gray-900 text-base leading-relaxed mb-1">
                তাই, সঠিক ব্যক্তিকে বেছে নেওয়া মাস্টার্স প্রোগ্রামের আবেদন প্রক্রিয়ার একটি গুরুত্বপূর্ণ ধাপ। একটি ভালোভাবে তৈরি রেকমেন্ডেশন লেটার, যেখানে আপনার যোগ্যতা ও অর্জন স্পষ্টভাবে উল্লেখ থাকবে, বিশ্ববিদ্যালয়ে ভর্তি হওয়ার সম্ভাবনা বাড়িয়ে দেবে।
            </p>
        </section>
    );
}
