import {LightbulbIcon} from "lucide-react";

export default function IeltsTipsSection() {
    return (
        <section className="mx-auto mt-10 bg-white p-4 rounded-xl">
            <h2 className="text-2xl md:text-3xl font-bold mb-3">
                ২. IELTS প্রস্তুতির টিপস
            </h2>
            <p className="mb-5 text-gray-800 text-base leading-relaxed">
                IELTS পরীক্ষার প্রস্তুতি শুরু করা অনেক সময় চাপের মতো মনে হতে পারে, তবে আমরা আপনার জন্য কিছু টিপস নিয়ে
                এসেছি যা দিয়ে আপনি শুরু করতে পারেন।
            </p>
            <ul className="list-disc pl-6 space-y-3 text-gray-800 text-base">
                <li>
                    <b>প্র্যাকটিস টেস্ট নিন:</b> আপনার দুর্বল এবং শক্তিশালী দিক চিহ্নিত করতে একটি প্র্যাকটিস টেস্ট দিন।
                    এতে আপনার প্রস্তুতির ফোকাস ঠিক থাকবে।
                </li>
                <li>
                    <b>টেস্ট ফরম্যাট বুঝুন:</b> প্রতিটি অংশের জন্য IELTS টেস্টের ফরম্যাট এবং প্রশ্নের ধরন সম্পর্কে
                    জানুন। ফরম্যাটের সঙ্গে পরিচিত হওয়া সফলতার জন্য খুব জরুরি।
                </li>
                <li>
                    <b>সময়সীমার ব্যাপারে সচেতন থাকুন:</b> সময়সীমার অভ্যাস করতে টাইমার সেট করে নমুনা প্রশ্ন বা
                    প্র্যাকটিস টেস্টে কাজ করুন। এতে আপনি বাস্তব পরীক্ষায় সময়ের চাপ মোকাবেলা করতে সক্ষম হবেন।
                </li>
                <li>
                    <b>ইংরেজি দক্ষতা বাড়ান:</b> IELTS হচ্ছে ইংরেজি দক্ষতা পরিমাপের পরীক্ষা, তাই IELTS প্র্যাকটিসের
                    পাশাপাশি ইংরেজিও উন্নত করুন। ৩-৬ মাস আগে থেকে প্রস্তুতি শুরু করা ভালো।
                </li>
                <li>
                    <b>শুনার সময় একাধিক কাজ করুন:</b> ইংরেজি কথোপকথন শুনে অনুশীলন করুন এবং কিছু মিস করলে দ্রুত ফিরে
                    আসার চেষ্টা করুন। বিভিন্ন ধরনের প্রশ্নের জন্য কী তথ্য দিতে হবে তা বুঝুন।
                </li>
                <li>
                    <b>বিভিন্ন ধরনের পড়ার দক্ষতা উন্নত করুন:</b> দ্রুত টেক্সট দেখে মূল পয়েন্ট বুঝার (স্কিমিং) মতো কৌশল
                    ব্যবহার করুন, লেখকের মতামতগুলো লক্ষ্য করুন এবং বিভিন্ন প্রশ্নের ধরনে অভ্যস্ত হন।
                </li>
                <li>
                    <b>লিখন অংশে সঠিক ইংরেজি ব্যবহার করুন:</b> Task 1 এর জন্য আনুষ্ঠানিক স্টাইলে লেখা অনুশীলন করুন এবং
                    Task 2 এর জন্য প্রবন্ধের কাঠামো শিখুন। Task 1 এ বিভিন্ন চার্টের জন্য উপযুক্ত ভাষা ব্যবহার করুন এবং
                    সাধারণ IELTS প্রবন্ধ বিষয় নিয়ে অনুশীলন করুন।
                </li>
                <li>
                    <b>স্বচ্ছন্দ ও স্পষ্টভাবে কথা বলুন:</b> স্পিকিং পরীক্ষার প্রতিটি অংশ অনুশীলন করুন, যার মধ্যে আছে
                    র‍্যান্ডম টপিক নিয়ে আলোচনা। উচ্চারণ, শব্দভান্ডার এবং ধ্রুততার ওপর গুরুত্ব দিন। দুই মিনিট কথা বলার
                    জন্য নোট নেওয়ার অভ্যাস করুন।
                </li>
                <li>
                    <b>ইংরেজির মধ্যে নিজেকে ডুবিয়ে দিন:</b> প্রতিদিন ইংরেজিতে পড়ুন, লিখুন এবং নেটিভ স্পিকারদের শুনুন।
                    ‘শ্যাডোইং’ কৌশল ব্যবহার করে উচ্চারণ ও স্বরোচ্চারণ উন্নত করুন। অন্যদের থেকে ফিডব্যাক নিন অথবা
                    প্রশিক্ষণ প্রতিষ্ঠান থেকে গাইডেন্স নিন।
                </li>
            </ul>

            <div className="flex gap-2 items-center bg-blue-50 border border-blue-100 rounded-xl p-5 mt-7">

                <div>
                    <div className="text-base font-semibold text-blue-900 mb-1 flex gap-4">
                         <span className="text-yellow-400"><LightbulbIcon/></span>
                        মনে রাখবেন
                    </div>
                    <div className="text-gray-800 leading-normal">
                        অধ্যবসায়ই হল IELTS প্রস্তুতির সাফল্যের চাবিকাঠি। দৃঢ় মনোবল বজায় রাখুন, তাহলে আপনার ইংরেজি
                        দক্ষতা উন্নত হবে এবং পরীক্ষায় সফল হওয়ার সম্ভাবনা বাড়বে।
                    </div>
                </div>
            </div>
        </section>
    );
}
