import React from "react";


const KnowledgeCenterList: React.FC = () => {
  const posts: string[] = [
    '(মে থেকে আগস্ট ২০২৫) আইইএলটিএস স্পিকিং কিট কার্ড: টপিকস, স্যাম্পল উত্তরসহ পিডিএফ',
    'কানাডায় ১ বছরের কোর্সসমূহ: সেরা কোর্স ও কলেজের তালিকা ২০২৪',
    'আন্তর্জাতিক শিক্ষার্থীদের জন্য নিউজিল্যান্ডে ১ বছরের ডিপ্লোমা কোর্স',
      'আন্তর্জাতিক শিক্ষার্থীদের জন্য যুক্তরাজ্যে ১ বছরের মাস্টার্স প্রোগ্রাম ২০২৩',
    'আন্তর্জাতিক শিক্ষার্থীদের জন্য যুক্তরাষ্ট্রে ১ বছরের মাস্টার্স প্রোগ্রাম ২০২৩: প্রোগ্রাম, বিশ্ববিদ্যালয়, খরচ, চাকরি',
    'আন্তর্জাতিক শিক্ষার্থীদের জন্য জার্মানিতে পড়ার জন্য সেরা ১০টি কোর্স ২০২৫',
    'ভবিষ্যতের জন্য উচ্চ বেতনের সেরা ১০টি ইঞ্জিনিয়ারিং কোর্স',
    'কানাডায় সেরা ১০টি মাস্টার্স কোর্স ২০২৪: শীর্ষ বিশ্ববিদ্যালয় ও যোগ্যতা',
    'নিউজিল্যান্ডের সেরা ১০টি বিশ্ববিদ্যালয়: শীর্ষ কলেজ ও জীবনযাত্রার খরচ',
    '২০২৫ সালে বিদেশে পড়াশোনায় বৃত্তি পাওয়ার সহজ ১০ ধাপ',
    'অস্ট্রেলিয়ায় ২০২৫ সালের সর্বোচ্চ বেতনের সেরা ১০টি চাকরি: সম্পূর্ণ গাইড',
    'ডুওলিঙ্গো ইংরেজি টেস্ট স্কোর বাড়াতে ১৫টি ভোকাবুলারি শব্দ',
    '২১৪(বি) ভিসা রিফিউজাল: বাতিলের কারণ, স্যাম্পল ও পুনরায় আবেদন',
    'আইইএলটিএস-এর জন্য ৩৫০+ ইংরেজি ভোকাবুলারি শব্দ: ২০২৫ সালের শব্দ তালিকা',
    '২০২৫ সালের জন্য ৩৫০+ টপ SAT শব্দ: পূর্ণ SAT ভোকাবুলারি তালিকা',
    '২০২৫ সালে এমবিএ করার জন্য সেরা ৫টি দেশ: বিশ্ববিদ্যালয়, কোর্স, বৃত্তি',
    'যুক্তরাজ্যে আইইএলটিএস গ্রহণকারী শীর্ষ ৫টি বিশ্ববিদ্যালয়',
    'ডুওলিঙ্গো ইংরেজি টেস্টে প্রায় ব্যবহৃত ৫০টি ভোকাবুলারি শব্দ',
    'ডুওলিঙ্গো ইংরেজি টেস্টের জন্য ১০০+ স্পিকিং টপিকস: প্রশ্ন, স্যাম্পল ও টিপস',
    'প্রতিদিন ব্যবহৃত ৫০০+ ইংরেজি শব্দ: সবচেয়ে সাধারণ শব্দের অর্থসহ',
    'আইইএলটিএস রাইটিং টাস্ক ২-এর জন্য ৬০+ প্রবন্ধ টপিকস ২০২৪: স্যাম্পল ও টিপস',
    '২০২৫ সালে বিদেশে আইন পড়ার জন্য সেরা ৭টি দেশ',
    'কানাডায় নার্সিং ক্যারিয়ার গড়ার ৭টি কারণ',
    'কানাডায় বিবিএ পড়ার জন্য সেরা ৮টি কলেজ: যোগ্যতা, বৃত্তি ও চাকরির সুযোগ',
    'বিদেশে পড়াশোনার পরামর্শকের প্রয়োজন কেন: ৮টি কারণের বিস্তারিত গাইড',
    'কানাডার শীর্ষ ৮টি বিশ্ববিদ্যালয়: র‍্যাঙ্কিং, ভর্তি প্রক্রিয়া ও ফি',
    'ডুওলিঙ্গো টেস্টে ছবি বর্ণনা টাস্ক সফল হওয়ার ৯টি বিশেষজ্ঞ টিপস',
    'জার্মানিতে ৭টি শীর্ষ অ্যাডভান্সড সায়েন্স বিশ্ববিদ্যালয়ের গাইড ২০২৫',
    'লিথুয়ানিয়ায় জীবনযাত্রার খরচের গাইড ২০২৪',
    'নিউজিল্যান্ডে জীবনযাত্রার খরচের গাইড ২০২৪',
    'কানাডার SX1 ভিসার গাইড: যোগ্যতা, সফলতার হার ও বয়সসীমা',
    'আন্তর্জাতিক শিক্ষার্থীদের জন্য যুক্তরাজ্যে পড়াশোনার খরচের গাইড ২০২৫',
    'সুইজারল্যান্ডে পড়াশোনার খরচের গাইড ২০২৫',
    'SDS এবং নন-SDS কানাডা ভিসা অ্যাপ্লিকেশনের গাইড: শীর্ষ ৫ বিশ্ববিদ্যালয় ও প্রয়োজনীয় ডকুমেন্টস',
    'ভোকেশনাল কোর্সের গাইড ২০২৫: অর্থ ও এসএসসি পরবর্তী কোর্সের তালিকা',
    'আল্টো বিশ্ববিদ্যালয়ে গ্রীষ্মকালীন ইন্টার্নশিপ (ফিনল্যান্ড)',
    'সংক্ষিপ্ত শব্দ ও এক্রোনিম: প্রচলিত ব্যবহার',
    'জার্মানিতে ACCA ডিগ্রিধারীদের বেতন ২০২৪-২০২৫ সালে প্রত্যাশা',
    'যুক্তরাজ্যে ACCA ডিগ্রিধারীদের বেতন ২০২৪: সারসংক্ষেপ, সুযোগ ও সুবিধা',
    'যুক্তরাজ্যের ACCA বিশ্ববিদ্যালয়সমূহ: ২০২৩ সালের সেরা ৭টি কোর্স',
    'যুক্তরাজ্যে অ্যাকাউন্টিং ২০২২: যোগ্যতা, খরচ, শীর্ষ কলেজ ও ভর্তি প্রক্রিয়া',
    'ACT বনাম SAT ২০২৩: কোনটি সহজ?',
    'আজারবাইজানে ADA বিশ্ববিদ্যালয় ফেলোশিপ ২০২৪',
    'Adam’s Wine রিডিং আন্সার ২০২৪: আইইএলটিএস রিডিং প্র্যাকটিস টেস্ট (উত্তরসহ)',
    'ছবি বর্ণনার জন্য অ্যাডভান্স ভোকাবুলারি: ভুলভ্রান্তি ও পরীক্ষায় সফলতার গাইড',
    'আইইএলটিএস বিজ্ঞাপন বিষয়ক ভোকাবুলারি ২০২৪: শব্দভাণ্ডার ও উচ্চারণ অনুশীলন',
    'Advice বনাম Advise: পার্থক্য',
    'অ্যারোনটিক্যাল ইঞ্জিনিয়ারদের বেতন ২০২৪: তারা কত আয় করেন?',
    'যুক্তরাজ্যে অ্যারোস্পেস ইঞ্জিনিয়ারদের বেতন ২০২৪: সম্পূর্ণ গাইড',
    'বিশ্বব্যাপী অ্যারোস্পেস ইঞ্জিনিয়ারদের বেতন ২০২৪',
    'যুক্তরাজ্যে অ্যারোস্পেস ইঞ্জিনিয়ারদের বেতন ২০২৪: একটি সারসংক্ষেপ',
    'নিউজিল্যান্ডে আন্তর্জাতিক শিক্ষার্থীদের জন্য সাশ্রয়ী বিশ্ববিদ্যালয় ২০২৫',
    'অস্ট্রেলিয়ায় সাশ্রয়ী বিশ্ববিদ্যালয়সমূহ ২০২৫: বিশ্ববিদ্যালয়, বৃত্তি ও যোগ্যতা',
    'যুক্তরাজ্যে কৃষি শিক্ষা ২০২২: যোগ্যতা, খরচ, শীর্ষ কলেজ ও ভর্তি প্রক্রিয়া',
    'যুক্তরাজ্যে কৃষি শিক্ষা: শীর্ষ স্কুল ২০২২',
    'Alexander Henderson রিডিং: আসার',
    'এমবিএ বৃত্তি বিষয়ক সবকিছু: বৃত্তি পাওয়ার সম্ভাবনা বাড়ানোর ৪টি উপায়',
    'AP ওভারসিজ স্কলারশিপ ২০২৩: বৃত্তির পরিমাণ, যোগ্যতা ও শেষ তারিখ',
    'GRE পরীক্ষার জন্য এখনই আবেদন করুন! সহজ নতুন নিবন্ধন ধাপসমূহ',
    'যুক্তরাজ্যের ভিসার জন্য আবেদন: ধরন, প্রক্রিয়া, ফি ও সময়সীমা',
    'এপ্রিল/মে ইন্টেক  ইউএসএ ২০২৬: শীর্ষ বিশ্ববিদ্যালয়, কোর্স ও ডেডলাইন',
    'ARIAM রিসোর্স হাব পিএইচডি স্কলারশিপ, সিডনী',
    'যুক্তরাজ্যে কৃত্রিম বুদ্ধিমত্তা প্রকৌশলীদের বেতন ২০২৫: সারসংক্ষেপ, সুযোগ ও সুবিধা',
    'এশিয়ান ডেভেলপমেন্ট ব্যাংক-জাপান স্কলারশিপ প্রোগ্রাম (ADB-JSP) ২০২৫',
    'কানাডায় বায়োলজিতে সায়েন্স অ্যাসোসিয়েট ২০২২: সুযোগ, কলেজ ও যোগ্যতা',
    'AU ই্মারজিং গ্লোবাল লিডার স্কলারশিপ | আমেরিকান ইউনিভার্সিটি, যুক্তরাজ্যে পড়াশোনা',
    'অস্ট্রেলিয়ার পূর্ণ ও আংশিক অর্থায়িত বৃত্তি আন্তর্জাতিক শিক্ষার্থীদের জন্য',
    'অস্ট্রেলিয়ার ইন্টেক ২০২৫-২০২৬: টাইমলাইন, ডেডলাইন ও সেরা ইন্টেক',
    'আন্তর্জাতিক গ্র্যাজুয়েটের জন্য অস্ট্রেলিয়ায় নতুন সুযোগ',
    'অস্ট্রেলিয়ার স্টুডেন্ট ভিসা পরিবর্তন জুলাই ২০২৪ থেকে: সর্বশেষ আপডেট জানুন',
    'বিশ্বের সেরা এক্সিকিউটিভ এমবিএ প্রোগ্রাম',
    'বিশ্বের সেরা ফ্যাশন ডিজাইন স্কুল',
    'কানাডায় এভিয়েশন ট্রেইনিয়ারের জন্য সেরা ফ্লাই স্কুল',
    'যুক্তরাজ্যের সেরা ফ্লাই স্কুল ২০২৪: ফি ও শীর্ষ স্কুল',
    '২০২৪ সালের সেরা আইইএলটিএস বই: সবচেয়ে জনপ্রিয় ম্যাটেরিয়াল',
    '২০২২ সালের সেরা আইইএলটিএস প্রস্তুতি অ্যাপ, অনলাইন সাইট ও বই',
    'আন্তর্জাতিক শিক্ষার্থীদের জন্য যুক্তরাজ্যে সেরা ইন্টার্নশিপ ২০২৩',
    'বিশ্বের সেরা এমবিবি কলেজ ২০২৪',
    'অস্ট্রেলিয়া বনাম যুক্তরাজ্য: সেরা পড়াশোনার পথ এবং গাইড',
    'অস্ট্রেলিয়ান গভর্নমেন্ট ভিসা ট্রেনিং প্রোগ্রাম স্কলারশিপ (আন্তর্জাতিক) ২০২৪',
    'অস্ট্রেলিয়ান স্টুডেন্ট ভিসার সফলতা ও প্রত্যাখ্যান হার ২০২৪',
    'অস্ট্রিয়ায় চাকরির প্রার্থীর ভিসা আন্তর্জাতিক নাগরিকদের জন্য',
    'অস্ট্রিয়া স্টুডেন্ট ভিসা: প্রয়োজনীয়তা, খরচ ও প্রসেসিং টাইম',
    'যুক্তরাজ্যে কম্পিউটার ইঞ্জিনিয়ারদের গড় বেতন ২০২৪',
    'যুক্তরাজ্যে কম্পিউটার ইঞ্জিনিয়ারদের গড় বেতন: সারসংক্ষেপ, সুযোগ ও সুবিধা',
    'যুক্তরাজ্যে জীবনযাত্রার গড় খরচ ২০২৪',
    'যুক্তরাজ্যে দর্শনশাস্ত্রের গড় বেতন ২০২৪',
    'যুক্তরাজ্যে নার্সদের গড় বেতন ২০২৪: মাসিক বেতন বিশ্লেষণ',
    'যুক্তরাজ্যে রেডিওলজিস্টদের গড় বেতন: সারসংক্ষেপ, সুযোগ ও সুবিধা',
    'আয়ারল্যান্ডে আন্তর্জাতিক শিক্ষার্থীদের গড় বেতন: পূর্ণাঙ্গ বিস্তারিত',
    'জাপানে আন্তর্জাতিক শিক্ষার্থীদের গড় বেতন ২০২৪',
    'নিউজিল্যান্ডে আন্তর্জাতিক শিক্ষার্থীদের গড় বেতন: পূর্ণাঙ্গ বিস্তারিত',
    'যুক্তরাজ্যে গড় বেতন ২০২৪: সেরা গাইড',
    'যুক্তরাজ্যে সফটওয়্যার ইঞ্জিনিয়ারদের গড় বেতন ২০২৪',
    'যুক্তরাজ্যে ওয়ার্কিএটরদের গড় বেতন ২০২৪: বাড়তি সুবিধাসহ সেরা সুযোগ',
    'যুক্তরাজ্যে সার্টিফাইড ম্যানেজমেন্ট অ্যাকাউন্ট্যান্টদের গড় বেতন: সারসংক্ষেপ, সুযোগ ও সুবিধা',
    'যুক্তরাজ্যে ইঞ্জিনিয়ারদের গড় বেতন ২০২৪: সারসংক্ষেপ, সুযোগ ও সুবিধা',
    'যুক্তরাজ্যে ফিজিওথেরাপিস্টদের গড় বেতন ২০২৪: সারসংক্ষেপ, সুযোগ ও আরও',
    'যুক্তরাজ্যে পাইলটদের গড় বেতন ২০২৪: সেরা চাকরি ও ভবিষ্যৎ সম্ভাবনা',
    'আজারবাইজানে গভর্নমেন্ট স্কলারশিপ ২০২৩ | হেদার আলিয়েভ ইন্টারন্যাশনাল এডুকেশন গ্রান্ট প্রোগ্রাম',
    'যুক্তরাজ্যে BTEC: বিশ্ববিদ্যালয় ও কোর্স বিস্তারিত',
    'কানাডায় ব্যাচেলর ডিগ্রি: সারসংক্ষেপ, বৃত্তি, শীর্ষ কলেজ',
    'কানাডার ব্যাচেলর: ফি, যোগ্যতা ও বিশ্ববিদ্যালয়',
    'আন্তর্জাতিক শিক্ষার্থীদের জন্য জার্মানিতে ব্যাচেলর ডিগ্রি ২০২৪-২০২৫',
    'যুক্তরাজ্যে এলএলবি (আইন) ব্যাচেলর ডিগ্রি: শীর্ষ বিশ্ববিদ্যালয়, যোগ্যতা ও ফি',
    'কানাডায় বাড়তি পোস্টডোক্টোরাল ফেলোশিপ: যোগ্যতা, সুবিধা ও আবেদন প্রক্রিয়া',
    '৬ বা ৭ এর মধ্যে PTE ইমেজ বর্ণনা: টেমপ্লেট, স্যাম্পল উত্তর ও টিপস',
    'বার্সেলোনা গ্র্যাজুয়েট স্কুল অফ ইকোনমিক্স স্কলারশিপ ২০২৩ | স্পেনে পড়াশোনা',
    'যুক্তরাজ্যে বিবিএ: বিশ্ববিদ্যালয় ও কোর্স বিস্তারিত',
    'যুক্তরাজ্যে BEng ডিগ্রিধারীদের বেতন ২০২৪: সারসংক্ষেপ, চাকরি ও সুযোগ',
    'কানাডায় ক্লিনিক্যাল সাইকোলজিস্ট হওয়া: যোগ্যতা, ফি ও প্রক্রিয়া',
    'Belief বনাম Believe: পার্থক্য',
    'Coconut Palm Reading-এর সেরা উত্তর: আইইএলটিএস রাইটিং ২০২৪',
    'বিশ্বের সেরা আর্কিটেকচার কলেজ: র‍্যাঙ্কিং, ফি ও ভর্তি',
    'বিশ্বের সেরা আর্ট স্কুল: বিশ্ববিদ্যালয় ও কোর্স',
    'জার্মানিতে সেরা বিজনেস স্কুল ও কলেজ ২০২৪-২০২৫',
    'কানাডার মে ২০২২ ইন্টেকের সেরা কলেজ',
    'যুক্তরাজ্যে বসবাসের জন্য সেরা শহরসমূহ ২০২৩',
    'আন্তর্জাতিক শিক্ষার্থীদের জন্য অস্ট্রেলিয়ায় পড়াশোনার সেরা শহরসমূহ',
    'কানাডায় বসবাসের জন্য সেরা শহর ২০২৪: শীর্ষ ৫টি',
    'আন্তর্জাতিক শিক্ষার্থীদের জন্য কানাডার সেরা কমিউনিটি কলেজ',
    '২০২৪ সালে বিদেশে পড়াশোনার জন্য সেরা দেশসমূহ',
    '২০২৪ সালে বিদেশে পড়াশোনার জন্য সেরা দেশ: শীর্ষ নির্বাচন ও সুবিধা',
    '২০২৩ সালে বিদেশে পড়াশোনার জন্য সেরা দেশসমূহ',
    'আন্তর্জাতিক শিক্ষার্থীদের জন্য ইউরোপে পড়াশোনার সেরা দেশ ২০২৪',
    '২০২৫ সালে ইঞ্জিনিয়ারিং পড়ার জন্য সেরা দেশ: কেন ও কোথায়',
    'এইচএসসি পরবর্তী উচ্চ বেতনের সেরা ইঞ্জিনিয়ারিং কোর্স ২০২৫',
    'কানাডার সেরা ইঞ্জিনিয়ারিং বিশ্ববিদ্যালয়: কোর্স ও ফি ২০২৫',
    'বিশ্বের সেরা এক্সিকিউটিভ এমবিএ প্রোগ্রাম',
    'বিশ্বের সেরা ফ্যাশন ডিজাইন স্কুল',
    'কানাডার এভিয়েহসনের জন্য সেরা ফ্লাইং স্কুল',
    'যুক্তরাষ্ট্রের সেরা ফ্লাইং স্কুল ২০২৪ঃ ফি ও শীর্ষ স্কুল',
    ' আন্তর্জাতিক শিক্ষার্থীদের জন্য যুক্তরাজ্যে সেরা ইন্টার্নশিপ ২০২৫',
    'বিশ্বের সেরা এমবিএ কলেজ',
  ];

  return (
    <div className="max-w-4xl mx-auto my-8 font-sans">
      {/* ক্যাটাগরি লিস্ট দেখাচ্ছে */}
      
      {/* Knowledge Center পোস্টসমূহ */}
      <div className="bg-white p-6 rounded-lg shadow-md mt-6">
        <h1 className="text-4xl font-bold mb-6 text-start text-blue-800">পোস্টসমূহ</h1>

        <ul className="space-y-4">
          {posts.map((post, index) => (
            <li key={index}>
              <a
                href={`/posts/${index + 1}`}
                className="text-lg text-gray-800 hover:text-blue-600 transition-colors duration-200 block pb-2"
              >
                <span className="text-black mr-2">•</span>
                {post}
              </a>
            </li>
          ))}
        </ul>
      </div>
    </div>
  );
};

export default KnowledgeCenterList;
